ArteryTek/AT32F490_HAL_Driver/src/at32f490_dma.c
/**
  **************************************************************************
  * @file     at32f490_dma.c
  * @brief    contains all the functions for the dma firmware library
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to 
  * download from Artery official website is the copyrighted work of Artery. 
  * Artery authorizes customers to use, copy, and distribute the BSP 
  * software and its related documentation for the purpose of design and 
  * development in conjunction with Artery microcontrollers. Use of the 
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f490_conf.h"

/** @addtogroup AT32F490_periph_driver
  * @{
  */

/** @defgroup DMA
  * @brief DMA driver modules
  * @{
  */

#ifdef DMA_MODULE_ENABLED

/** @defgroup DMA_private_functions
  * @{
  */

/**
  * @brief  reset dmax channely register.
  * @param  dmax_channely: 
  *         this parameter can be one of the following values:  
  *         - DMA1_CHANNEL1      
  *         - DMA1_CHANNEL2  
  *         - DMA1_CHANNEL3      
  *         - DMA1_CHANNEL4 
  *         - DMA1_CHANNEL5      
  *         - DMA1_CHANNEL6  
  *         - DMA1_CHANNEL7      
  *         - DMA2_CHANNEL1      
  *         - DMA2_CHANNEL2  
  *         - DMA2_CHANNEL3      
  *         - DMA2_CHANNEL4 
  *         - DMA2_CHANNEL5      
  *         - DMA2_CHANNEL6  
  *         - DMA2_CHANNEL7    
  * @retval none.
  */
void dma_reset(dma_channel_type *dmax_channely)
{
  uint32_t temp = 0;
  dmax_channely->ctrl_bit.chen = FALSE;
  dmax_channely->ctrl = 0;
  dmax_channely->dtcnt = 0;
  dmax_channely->paddr = 0;
  dmax_channely->maddr = 0;

  temp = (uint32_t)dmax_channely;
  
  if((temp & 0x6FF) < 0x608)
  {
    /* dma1 channel */
    DMA1->clr |= (uint32_t)(0x0F << ((((temp & 0xFF) - 0x08) / 0x14) * 4)); 
  }
  else if((temp & 0x6FF) < 0x688)
  {
    /* dma2 channel */
    DMA2->clr |= (uint32_t)(0x0F << ((((temp & 0xFF) - 0x08) / 0x14) * 4));   
  }
}

/**
  * @brief  set the number of data to be transferred.
  * @param  dmax_channely: 
  *         this parameter can be one of the following values:  
  *         - DMA1_CHANNEL1      
  *         - DMA1_CHANNEL2  
  *         - DMA1_CHANNEL3      
  *         - DMA1_CHANNEL4 
  *         - DMA1_CHANNEL5      
  *         - DMA1_CHANNEL6  
  *         - DMA1_CHANNEL7      
  *         - DMA2_CHANNEL1      
  *         - DMA2_CHANNEL2  
  *         - DMA2_CHANNEL3      
  *         - DMA2_CHANNEL4 
  *         - DMA2_CHANNEL5      
  *         - DMA2_CHANNEL6  
  *         - DMA2_CHANNEL7  
  * @param  data_number: the number of data to be transferred (0x0000~0xFFFF).
  * @retval none.
  */
void dma_data_number_set(dma_channel_type *dmax_channely, uint16_t data_number)
{
  dmax_channely->dtcnt = data_number;
}

/**
  * @brief  get the number of data to be transferred.
  * @param  dmax_channely: 
  *         this parameter can be one of the following values:  
  *         - DMA1_CHANNEL1      
  *         - DMA1_CHANNEL2  
  *         - DMA1_CHANNEL3      
  *         - DMA1_CHANNEL4 
  *         - DMA1_CHANNEL5      
  *         - DMA1_CHANNEL6  
  *         - DMA1_CHANNEL7      
  *         - DMA2_CHANNEL1      
  *         - DMA2_CHANNEL2  
  *         - DMA2_CHANNEL3      
  *         - DMA2_CHANNEL4 
  *         - DMA2_CHANNEL5      
  *         - DMA2_CHANNEL6  
  *         - DMA2_CHANNEL7  
  * @retval the number value.
  */
uint16_t dma_data_number_get(dma_channel_type *dmax_channely)
{
  return (uint16_t)dmax_channely->dtcnt;
}

/**
  * @brief  enable or disable dma interrupt. 
  * @param  dmax_channely: 
  *         this parameter can be one of the following values:  
  *         - DMA1_CHANNEL1      
  *         - DMA1_CHANNEL2  
  *         - DMA1_CHANNEL3      
  *         - DMA1_CHANNEL4 
  *         - DMA1_CHANNEL5      
  *         - DMA1_CHANNEL6  
  *         - DMA1_CHANNEL7      
  *         - DMA2_CHANNEL1      
  *         - DMA2_CHANNEL2  
  *         - DMA2_CHANNEL3      
  *         - DMA2_CHANNEL4 
  *         - DMA2_CHANNEL5      
  *         - DMA2_CHANNEL6  
  *         - DMA2_CHANNEL7 
  * @param  dma_int: 
  *         this parameter can be any combination of the following values:
  *         - DMA_FDT_INT                   
  *         - DMA_HDT_INT                      
  *         - DMA_DTERR_INT                       
  * @param  new_state (TRUE or FALSE)   
  * @retval none.
  */
void dma_interrupt_enable(dma_channel_type *dmax_channely, uint32_t dma_int, confirm_state new_state)
{
  if(new_state != FALSE)
  {
    dmax_channely->ctrl |= dma_int;
  }
  else
  {
    dmax_channely->ctrl &= ~dma_int;
  }
}

/**
  * @brief  enable or disable dma channel.
  * @param  dmax_channely: 
  *         this parameter can be one of the following values:  
  *         - DMA1_CHANNEL1      
  *         - DMA1_CHANNEL2  
  *         - DMA1_CHANNEL3      
  *         - DMA1_CHANNEL4 
  *         - DMA1_CHANNEL5      
  *         - DMA1_CHANNEL6  
  *         - DMA1_CHANNEL7      
  *         - DMA2_CHANNEL1      
  *         - DMA2_CHANNEL2  
  *         - DMA2_CHANNEL3      
  *         - DMA2_CHANNEL4 
  *         - DMA2_CHANNEL5      
  *         - DMA2_CHANNEL6  
  *         - DMA2_CHANNEL7
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void dma_channel_enable(dma_channel_type *dmax_channely, confirm_state new_state)
{
  dmax_channely->ctrl_bit.chen = new_state;
}

/**
  * @brief  get dma interrupt flag
  * @param  dmax_flag
  *         this parameter can be one of the following values:
  *         - DMA1_FDT1_FLAG        - DMA1_HDT1_FLAG        - DMA1_DTERR1_FLAG
  *         - DMA1_FDT2_FLAG        - DMA1_HDT2_FLAG        - DMA1_DTERR2_FLAG
  *         - DMA1_FDT3_FLAG        - DMA1_HDT3_FLAG        - DMA1_DTERR3_FLAG
  *         - DMA1_FDT4_FLAG        - DMA1_HDT4_FLAG        - DMA1_DTERR4_FLAG
  *         - DMA1_FDT5_FLAG        - DMA1_HDT5_FLAG        - DMA1_DTERR5_FLAG
  *         - DMA1_FDT6_FLAG        - DMA1_HDT6_FLAG        - DMA1_DTERR6_FLAG
  *         - DMA1_FDT7_FLAG        - DMA1_HDT7_FLAG        - DMA1_DTERR7_FLAG
  *         - DMA2_FDT1_FLAG        - DMA2_HDT1_FLAG        - DMA2_DTERR1_FLAG
  *         - DMA2_FDT2_FLAG        - DMA2_HDT2_FLAG        - DMA2_DTERR2_FLAG
  *         - DMA2_FDT3_FLAG        - DMA2_HDT3_FLAG        - DMA2_DTERR3_FLAG
  *         - DMA2_FDT4_FLAG        - DMA2_HDT4_FLAG        - DMA2_DTERR4_FLAG
  *         - DMA2_FDT5_FLAG        - DMA2_HDT5_FLAG        - DMA2_DTERR5_FLAG
  *         - DMA2_FDT6_FLAG        - DMA2_HDT6_FLAG        - DMA2_DTERR6_FLAG
  *         - DMA2_FDT7_FLAG        - DMA2_HDT7_FLAG        - DMA2_DTERR7_FLAG
  * @retval state of dma flag
  */
flag_status dma_interrupt_flag_get(uint32_t dmax_flag)
{
  flag_status status = RESET;
  uint32_t temp = 0;

  if(dmax_flag > 0x10000000)
  {
    temp = DMA2->sts;
  }
  else
  {
    temp = DMA1->sts;
  }

  if ((temp & dmax_flag) != (uint16_t)RESET)
  {
    status = SET;
  }
  else
  {
    status = RESET;
  }

