ArteryTek/AT32F490_HAL_Driver/src/at32f490_dma.c
  if(dma_x == DMA1)
  {
    tmpreg = *(uint32_t*)(DMA1MUX_BASE + (index * regoffset));
  }
  else
  {
    tmpreg = *(uint32_t*)(DMA2MUX_BASE + (index * regoffset));
  }
  
  if((tmpreg & (uint32_t)0x00000100) != (uint32_t)RESET)
  {
    enablestatus = SET;
  }
  else
  {
    enablestatus = RESET;
  }
  
  if(dma_x == DMA1)
  {
    if(((DMA1->muxsyncsts & flag) != (uint32_t)RESET) && (enablestatus != RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
    if(((DMA2->muxsyncsts & flag) != (uint32_t)RESET) && (enablestatus != RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  return bitstatus;   
}

/**
  * @brief  dmamux sync flag clear.
  * @param  dma_x : pointer to a dma_type structure, can be DMA1 or DMA2.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - DMAMUX_SYNC_OV1_FLAG
  *         - DMAMUX_SYNC_OV2_FLAG 
  *         - DMAMUX_SYNC_OV3_FLAG
  *         - DMAMUX_SYNC_OV4_FLAG  
  *         - DMAMUX_SYNC_OV5_FLAG
  *         - DMAMUX_SYNC_OV6_FLAG  
  *         - DMAMUX_SYNC_OV7_FLAG          
  * @retval none.
  */
void dmamux_sync_flag_clear(dma_type *dma_x, uint32_t flag)
{
  dma_x->muxsyncclr = flag;  
}

/**
  * @brief  dmamux request generator flag get.
  * @param  dma_x : pointer to a dma_type structure, can be DMA1 or DMA2.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - DMAMUX_GEN_TRIG_OV1_FLAG
  *         - DMAMUX_GEN_TRIG_OV2_FLAG 
  *         - DMAMUX_GEN_TRIG_OV3_FLAG
  *         - DMAMUX_GEN_TRIG_OV4_FLAG            
  * @retval state of dmamux sync flag.
  */
flag_status dmamux_generator_flag_get(dma_type *dma_x, uint32_t flag)
{
  if((dma_x->muxgsts & flag) != RESET)
  {
    return SET;   
  }
  else
  {
    return RESET; 
  } 
}

/**
  * @brief  dmamux request generator interrupt flag get.
  * @param  dma_x : pointer to a dma_type structure, can be DMA1 or DMA2.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - DMAMUX_GEN_TRIG_OV1_FLAG
  *         - DMAMUX_GEN_TRIG_OV2_FLAG
  *         - DMAMUX_GEN_TRIG_OV3_FLAG
  *         - DMAMUX_GEN_TRIG_OV4_FLAG
  * @retval state of dmamux sync flag.
  */
flag_status dmamux_generator_interrupt_flag_get(dma_type *dma_x, uint32_t flag)
{
  flag_status bitstatus = RESET;
  uint32_t sync_int_temp = flag;
  uint32_t index = 0;
  uint32_t tmpreg = 0, enablestatus = 0;
  uint32_t regoffset = 0x4;
  
  while((sync_int_temp & 0x00000001) == RESET)
  {
    sync_int_temp = sync_int_temp >> 1;
    index++;
  }
  
  if(dma_x == DMA1)
    tmpreg = *(uint32_t*)(DMA1MUX_GENERATOR1_BASE + (index * regoffset));
  else
    tmpreg = *(uint32_t*)(DMA2MUX_GENERATOR1_BASE + (index * regoffset));
  
  if((tmpreg & (uint32_t)0x00000100) != (uint32_t)RESET)
  {
    enablestatus = SET;
  }
  else
  {
    enablestatus = RESET;
  }
  if(dma_x == DMA1)
  {
    if(((DMA1->muxgsts & flag) != (uint32_t)RESET) && (enablestatus != RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
    if(((DMA2->muxgsts & flag) != (uint32_t)RESET) && (enablestatus != RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  
  return bitstatus; 
}

/**
  * @brief  dmamux request generator flag clear.
  * @param  dma_x : pointer to a dma_type structure, can be DMA1 or DMA2.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - DMAMUX_GEN_TRIG_OV1_FLAG
  *         - DMAMUX_GEN_TRIG_OV2_FLAG 
  *         - DMAMUX_GEN_TRIG_OV3_FLAG
  *         - DMAMUX_GEN_TRIG_OV4_FLAG            
  * @retval none.
  */
void dmamux_generator_flag_clear(dma_type *dma_x, uint32_t flag)
{
  dma_x->muxgclr = flag; 
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
